__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 2, 300, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 2, 300, 32)   7712        input_1[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 2, 300, 32)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 2, 150, 32)   0           activation_1[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 2, 150, 32)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 2, 150, 32)   96          dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 2, 150, 32)   245792      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 2, 150, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 75, 32)    0           activation_2[0][0]               
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 2, 75, 32)    0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 2, 75, 32)    245792      dropout_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 2, 75, 32)    0           dropout_1[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 2, 75, 32)    0           conv2d_3[0][0]                   
                                                                 max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 2, 75, 32)    96          add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 2, 75, 32)    245792      batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 2, 75, 32)    0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 2, 150, 32)   0           activation_3[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 2, 150, 32)   0           up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 150, 32)   245792      dropout_3[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 2, 150, 32)   0           add_1[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 2, 150, 32)   0           conv2d_5[0][0]                   
                                                                 up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 2, 150, 32)   96          add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 2, 150, 32)   245792      batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 2, 150, 32)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 2, 300, 32)   0           activation_4[0][0]               
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 2, 300, 32)   0           up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 2, 300, 1)    33          dropout_4[0][0]                  
==================================================================================================
Total params: 1,236,993
Trainable params: 1,236,801
Non-trainable params: 192
__________________________________________________________________________________________________
